---
kind: property
id: P:Autodesk.Revit.DB.FootPrintRoof.Offset(Autodesk.Revit.DB.ModelCurve)
zh: 偏移、偏移量
source: html/9ea8c8b2-6c15-0c63-2e3f-3fac5aa284ad.htm
---
# Autodesk.Revit.DB.FootPrintRoof.Offset Property

**中文**: 偏移、偏移量

Retrieve or set the Offset of the curve.

## Syntax (C#)
```csharp
public double this[
	ModelCurve pCurve
] { get; set; }
```

## Parameters
- **pCurve** (`Autodesk.Revit.DB.ModelCurve`)